package com.Dasha.idea;
/*
Задание1. Написать программу, которая выводит в консоль строку “Hello World!”
 */
public class TaskWork01 {
    public static void main(String[] args){
        System.out.println("Hello World!");
}
}
