package com.Dasha.idea;

public class TaskWork02 {
    public static void main(String[] args)
    {
        /*Задание2.1 Создайть переменную типа с плавающей точкой с наибольшим диапазоном чисел.
        Присвойте ей произвольное дробное значение.*/
    double a = 12345.234;
        System.out.println ("Переменная а = " + a);
        /*Задание2.2 Создайть переменную типа с плавающей точкой с наибольшим диапазоном чисел.
        Присвойте ей произвольное дробное значение.*/
    byte b = 127;
        System.out.println ("ПЕременная b = " + b);
}
}